{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["hi", "hello", "hey", "good morning", "good evening"],
      "responses": ["Hello! How can I assist you with your health today?", "Hi there! Ask me anything about health awareness."]
    },
    {
      "tag": "goodbye",
      "patterns": ["bye", "goodbye", "see you", "take care"],
      "responses": ["Goodbye! Stay healthy and safe.", "See you soon! Take care of your health."]
    },
    {
      "tag": "dengue_symptoms",
      "patterns": ["what are dengue symptoms", "dengue signs", "symptoms of dengue", "how to know if I have dengue"],
      "responses": [
        "Common symptoms of dengue include high fever, severe headache, pain behind the eyes, joint and muscle pain, nausea, vomiting, swollen glands, or rash.",
        "Dengue symptoms: sudden high fever, severe headaches, pain behind eyes, muscle and joint pains, nausea, vomiting, skin rash."
      ]
    },
    {
      "tag": "malaria_prevention",
      "patterns": ["how to prevent malaria", "malaria prevention tips", "avoid malaria"],
      "responses": [
        "To prevent malaria: use mosquito nets, wear protective clothing, use insect repellents, and eliminate stagnant water around your surroundings.",
        "Malaria prevention includes using mosquito repellents, sleeping under insecticide-treated nets, and ensuring there is no stagnant water nearby."
      ]
    },
    {
      "tag": "hair_fall",
      "patterns": ["hair fall solutions", "why is my hair falling", "reduce hair fall"],
      "responses": [
        "Hair fall can happen due to stress, poor diet, or medical issues. Ensure you eat protein-rich food, avoid harsh chemicals, and consult a doctor if it continues.",
        "To reduce hair fall: eat a healthy diet, stay hydrated, avoid excessive heat styling, and oil your hair regularly."
      ]
    },
    {
      "tag": "vaccination",
      "patterns": ["vaccination schedule", "when should I get vaccinated", "vaccines for children"],
      "responses": [
        "Vaccination schedules vary by age. For children, important vaccines include BCG, Polio, DPT, Hepatitis B, and MMR. Please consult a doctor for accurate timings.",
        "It’s best to follow the national immunization schedule. Contact a healthcare provider for a detailed vaccination plan."
      ]
    }
  ]
}
